<template>
	<view style="padding: 10px;">
		隐私协议
		优安通应用是由苏州运优科技有限公司（以下简称“我们”）开发的一款产品，
		深知个人信息对您的重要性，并会尽全力保护您的个人信息安全可靠。我们致力于维持您对我们的信任，恪守以下原则，保护您的个人信息：权责一致原则、目的明确原则、选择同意原则、最少够用原则、确保安全原则、主体参与原则、公开透明原则等。同时，我们承诺，我们将按业界成熟的安全标准，采取相应的安全保护措施来保护您的个人信息。
		请在使用我们的产品（或服务）前，仔细阅读并了解本《隐私权政策》。
		一、我们如何收集和使用您的个人信息
		（一）我们将逐一说明我们收集的您的个人信息类型及其对应的用途，以便您了解我们针对某一特定功能所收集的具体个人信息的类别、使用理由及收售方式。
		（二）当您使用一些功能时，我们会在获得您的同意后，收集您的一些敏感信息，例如您在使用我们注册功能时我们会收集您您的个人信息，您在使用推荐通讯录朋友功能时我们会收集您的手机联系人信息，您在使用附近功能时我们会收集您的地理位置信息。除非按照相关法律法规要求必频收集，拒绝提供这些信息仅会使您无法使用相关特定功能，但不影响您正常使用我们的其他功能。
		（三）我们为您提供便捷的电子商务交易平台服务为了实现服务的提供，我们主要会基于如下需要收集使用、共享、存储您的个人信息：
		1、商品/服务的展示及便捷搜索：为节省您搜索商品的时间、提升您的网购效率，我们会利用我们的技术向您展示更契合您需求的商品/服务，包括结合对您兴趣偏好的预测及您的收藏、加购及已购记录向您推荐您可能需要的商品/服务(“推荐”频道/模块)。
		会员注册：当您注册我们帐号时，我们会收集您的昵称手机号码收集这些信息是为了帮助您完成我们帐号的注册，保护您的帐号安全。手机号码属于敏感信息，收集此类信息是为了满足相关法律法规关于网络实名制要求。若您不提供这类信息，您可能无法正常使用我们的服务。你还可以根据自身需求选择填写性别、地区等信息。
		2、客服及争议处理：在为您提供客服或争议纠纷处理服务时，我们需要收集和处理您的必要信息，用于验证您的身份、向您回复及回访我们服务人员的服务质量。
		3、当您使用我们服务时，为保障您正常使用我们的服务，维护我们服务的正常运行，改进及优化我们的服务体验以及保障您的帐号安全，我们会收集您的设备型号、操作系统、设备Mac地址、唯一设备标识符、应用列表、登录IP地址、
		我们软件版本号、接入网络的方式、类型和状态网络质量数据、操作日志、服务日志信息(如您在阅读功能下的浏览历史、服务故障信息等信息)等日志信息，这类信息是为提供服务必须收集的基础信息。此外，我们可能通过标识符及相关技术收集您的信息，为您提供个性化的用户体验、保障服务安全。
		4、安全保障：为保障您的账户及交易安全，我们需要收集和处理您的设备信息、日志信息，我们也会将这些信息用于预防发生各类违法违规或其他主体合法权益被侵害的情况。
		5、另外，根据相关法律法规及国家标准，以下情形中，我们可能会收集、使用您的相关个人信息无需征求您的授权同意
		（四）为保障我们客户端的稳定运行、功能实现，使您能够使用和享受更多的服务及功能，我们的应用中会嵌入授权合作伙伴的SDK。我们会对授权合作伙伴获取有关信息的应用程序接口(API)、软件工具开发包(SDK)进行严格的安全检测，并与授权合作伙伴约定严格的数据保护措施，令其按照本政策以及其他任何相关的保密和安全措施来处理个人信息。

		1)与国家安全、国防安全等国家利益直接相关的;与公共安全、公共卫生、公众知情等重大公共利益直接相关的;
		2)与犯罪侦查、起诉、审判和判决执行等直接相关的;
		3)出于维护您或其他个人的生命、财产、声誉等重大合法权益但又很难得到本人同意的;
		4)所收集的个人信息是您自行向社会公众公开的;
		5)从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道;
		6)根据您要求签订和履行合同所必需的;
		7)用于维护所提供的产品或服务的安全稳定运行所必需的，例如发现、处置产品或服务的故障;
		8)为开展合法的新闻报道所必需的;
		9)出于公共利益开展统计或学术研究所必要，且其对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的;
		10)法律法规规定的其他情形。
		请您理解，我们向您提供的功能和服务是不断更新和发展的，如果某一功能或服务未在前述说明中且收集了您的信息，我们会通过页面提示、交互流程、网站公告等方式另行向您说明信息收集的内容、范围和目的，以征得您的同意。
		二、我们如何使用 Cookie 和同类技术
		（一）Cookie
		为确保网站正常运转，我们会在您的计算机或移动设备上存储名为 Cookie 的小数据文件。Cookie 通常包含标识符、站点名称以及一些号码和字符。借助于 Cookie，网站能够存储您的偏好或购物篮内的商品等数据。
		我们不会将 Cookie 用于本政策所述目的之外的任何用途。您可根据自己的偏好管理或删除Cookie。您可以清除计算机上保存的所有 Cookie，大部分网络浏览器都设有阻止 Cookie
		的功能。但如果您这么做，则需要在每一次访问我们的网站时亲自更改用户设置。
		（二）网站信标和像素标签
		除 Cookie 外，我们还会在网站上使用网站信标和像素标签等其他同类技术。例如，我们向您发送的电子邮件可能含有链接至我们网站内容的点击
		URL。如果您点击该链接，我们则会跟踪此次点击，帮助我们了解您的产品或服务偏好并改善客户服务。网站信标通常是一种嵌入到网站或电子邮件中的透明图像。借助于电子邮件中的像素标签，我们能够获知电子邮件是否被打开。如果您不希望自己的活动以这种方式被追踪，则可以随时从我们的寄信名单中退订。
		（三）Do Not Track（请勿追踪）
		很多网络浏览器均设有 Do Not Track 功能，该功能可向网站发布 Do Not Track 请求。目前， 主要互联网标准组织尚未设立相关政策来规定网站应如何应对此类请求。但如果您的浏览器启用了Do Not
		Track，那么我们的所有网站都会尊重您的选择。
		三、我们如何共享、转让、公开披露您的个人信息
		（一）共享
		我们不会向其他任何公司、组织和个人分享您的个人信息，但以下情况除外： 1、在获取明确同意的情况下共享：获得您的明确同意后，我们会与其他方共享您的个人信息。
		2、我们可能会根据法律法规规定，或按政府主管部门的强制性要求，对外共享您的个人信息。

		3、与我们的关联公司共享：您的个人信息可能会与我们关联公司共享。我们只会共享必要的个人信息，且受本隐私政策中所声明目的的约束。关联公司如要改变个人信息的处理目的，将再次征求您的授权同意。
		4、与授权合作伙伴共享：仅为实现本隐私权政策中声明的目的，我们的某些服务将由授权合作伙伴提供。我们可能会与合作伙伴共享您的某些个人信息，以提供更好的客户服务和用户体验。例如，
		我们聘请来提供第三方数据统计和分析服务的公司可能需要采集和访问个人数据以进行数据统计和分析。在这种情况下，这些公司
		必须遵守我们的数据隐私和安全要求。我们仅会出于合法、正当、必要、特定、明确的目的共享您的个人信息，并且只会共享提供服务所必要的个人信息。
		（二）转让
		我们不会将您的个人信息转让给任何公司、组织和个人，但以下情况除外： 1、在获取明确同意的情况下转让：获得您的明确同意后，我们会向其他方转让您的个人信息；
		2、在涉及合并、收购或破产清算时，如涉及到个人信息转让，我们会在要求新的持有您个人信息的公司、组织继续受此隐私政策的约束，否则我们将要求该公司、组织重新向您征求授权同意。
		（三）公开披露
		我们仅会在以下情况下，公开披露您的个人信息： 1、获得您明确同意后；
		2、基于法律的披露：在法律、法律程序、诉讼或政府主管部门强制性要求的情况下，我们可能会公开披露您的个人信息。
		四、我们如何保护您的个人信息
		（一）我们已使用符合业界标准的安全防护措施保护您提供的个人信息，防止数据遭到未经授权访问、公开披露、使用、修改、损坏或丢失。我们会采取一切合理可行的措施，保护您的个人信息。例如，在您的浏览器与“服务”之间交换数据（如信用卡信息）时受
		SSL 加密保护；我们同时对我们网站提供 https
		安全浏览方式；我们会使用加密技术确保数据的保密性；我们会使用受信赖的保护机制防止数据遭到恶意攻击；我们会部署访问控制机制，确保只有授权人员才可访问个人信息；以及我们会举办安全和隐私保护培训课程，加强员工对于保护个人信息重要性的认识。
		（二）我们会采取一切合理可行的措施，确保未收集无关的个人信息。我们只会在达成本政策所述目的所需的期限内保留您的个人信息，除非需要延长保留期或受到法律的允许。
		（三）互联网并非绝对安全的环境，而且电子邮件、即时通讯、及与其他我们用户的交流方式并未加密，我们强烈建议您不要通过此类方式发送个人信息。请使用复杂密码，协助我们保证您的账号安全。
		（四）互联网环境并非百分之百安全，我们将尽力确保或担保您发送给我们的任何信息的安全性。如果我们的物理、技术、或管理防护设施遭到破坏，导致信息被非授权访问、公开披露、篡改、或毁坏，导致您的合法权益受损，我们将承担相应的法律责任。
		（五）在不幸发生个人信息安全事件后，我们将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。我们将及时将事件相关情况以邮件、信函、电话、推送通知等方式告知您，难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。
		同时，我们还将按照监管部门要求，主动上报个人信息安全事件的处置情况。五、您的权利
		按照中国相关的法律、法规、标准，以及其他国家、地区的通行做法，我们保障您对自己的个人信息行使以下权利：
		（一）访问您的个人信息
		您有权访问您的个人信息，法律法规规定的例外情况除外。如果您想行使数据访问权，可以通过以下方式自行访问：

		账户信息——如果您希望访问或编辑您的账户中的个人资料信息和支付信息、更改您的密码、添加安全信息或关闭您的账户等，您可以通过访问执行此类操作。
		搜索信息——您可以在应用中访问或清除您的搜索历史记录、查看和修改兴趣以及管理其他数据。
		六、本隐私权政策如何更新
		我们可能适时会对本隐私权政策进行调整或变更，本隐私权政策的任何更新将以标注更新时间的方式公布在我们网站上，除法律法规或监管规定另有强制性规定外，经调整或变更的内容一经通知或公布后的7日后生效。如您在隐私权政策调整或变更后继续使用我们提供的任一服务或访问我们相关网站的，我们相信这代表您已充分阅读、理解并接受修改后的隐私权政策并受其约束。
	</view>
</template>

<script>
	export default {
		data() {
			return {

			}
		},
		onShow() {
			uni.setNavigationBarColor({
				frontColor: '#ffffff',
				backgroundColor: this.pageStore.$state.themeColor.color,
				animation: {
					duration: 400,
					timingFunc: 'easeIn'
				}
			})
		},
	}
</script>

<style lang="scss">
	page {
		background: $color-white;
	}
</style>
